benchmark/result_10.txt
pgbench (18.4 (Debian 18.4-1.pgdg13+1))
transaction type: /benchmark/loan_query.sql
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 52051
number of failed transactions: 0 (0.000%)
latency average = 5.764 ms
initial connection time = 2.896 ms
tps = 1734.827294 (without initial connection time)