benchmark/result_100.txt
pgbench (18.4 (Debian 18.4-1.pgdg13+1))
transaction type: /benchmark/loan_query.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 30734
number of failed transactions: 0 (0.000%)
latency average = 97.663 ms
initial connection time = 47.351 ms
tps = 1023.925079 (without initial connection time)