benchmark/result_50.txt
pgbench (18.4 (Debian 18.4-1.pgdg13+1))
transaction type: /benchmark/loan_query.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 48847
number of failed transactions: 0 (0.000%)
latency average = 30.716 ms
initial connection time = 11.770 ms
tps = 1627.808964 (without initial connection time)